roles/emacs/files/init.org
#+PROPERTY: header-args:emacs-lisp :tangle "init.el" :mkdirp yes

* Base Functions
Definition of functions used throughout the config
#+begin_src emacs-lisp
  (defun not-android ()
      (not (eq system-type 'android)))
#+end_src
* Package Management
#+BEGIN_SRC emacs-lisp
  (require 'package)
  (setq package-archives
        '(("gnu" . "http://elpa.gnu.org/packages/")
          ("elpa" . "https://elpa.gnu.org/packages/")
          ("melpa" . "https://melpa.org/packages/")))
#+END_SRC

** use-package setup
#+BEGIN_SRC emacs-lisp
  (package-initialize)
  (require 'use-package)
  (setq use-package-always-ensure t)
  (use-package use-package-ensure-system-package
    :ensure t)
#+END_SRC
* Internal packages
#+begin_src emacs-lisp
      (use-package request
        :if (not-android))
#+end_src
* Defaults
#+BEGIN_SRC emacs-lisp
  (global-display-line-numbers-mode)
#+END_SRC
* Emacs
This is a pseudo package specifying all emacs builtin settings
#+BEGIN_SRC emacs-lisp
  (use-package emacs
    :custom
    (xref-search-program 'ripgrep)
    (tab-always-indent 'complete)
    (text-mode-ispell-word-completion nil)
    (tab-width 2)
    :bind
    ("C-x C-b" . ibuffer)
    :config
    (windmove-default-keybindings))

  (use-package polymode)
  (use-package aio)
#+END_SRC
* Tag Settings
Don't ask to reread a tags file if it was written outside of Emacs
#+BEGIN_SRC emacs-lisp
  (setq tags-revert-without-query 1)
#+END_SRC
* UI Settings 
** GUI Elements
Disable all GUI Elements
#+BEGIN_SRC emacs-lisp
  (scroll-bar-mode -1)
  (setq ring-bell-function 'ignore)
#+END_SRC
** menu-bar-mode
The menu-bar should only be visible in Android and there it should be at the bottom instead of the top
#+begin_src emacs-lisp
  (if (eq system-type 'android)
      (menu-bar-mode t)
    (menu-bar-mode -1))
#+end_src
** tool-bar-mode
The tool-bar should only be visible in Android and there it should be at the bottom instead of the top
#+begin_src emacs-lisp
    (if (eq system-type 'android)
        (progn
          (tool-bar-mode t)
          (set-frame-parameter nil 'tool-bar-position 'bottom))
      (tool-bar-mode -1))
#+end_src

** Touch Screen Keyboard
#+begin_src emacs-lisp
  (when (eq system-type 'android)
    (setq touch-screen-display-keyboard t))
#+end_src
** Better Help Buffers
#+BEGIN_SRC emacs-lisp
  (use-package helpful
    :bind
    ("C-h f" .  helpful-callable)
    ("C-h v" . helpful-variable)
    ("C-h k" . helpful-key)
    :custom
    (counsel-describe-function-function #'helpful-callable)
    (counsel-describe-variable-function #'helpful-variable))

#+END_SRC
** Icons
#+BEGIN_SRC emacs-lisp
  (use-package all-the-icons)
  (use-package all-the-icons-dired
    :hook
    (dired-mode . all-the-icons-dired-mode))
#+END_SRC
** Tab Bar Settings
#+BEGIN_SRC emacs-lisp
  (setq tab-bar-show nil)
#+END_SRC

** Theme
#+BEGIN_SRC emacs-lisp
      (use-package doom-themes
        :custom
        (doom-themes-enable-bold t)
        (doom-themes-enable-italic t)
        :config
        (load-theme 'doom-one-light t))

     (use-package acid-theme
       :load-path "~/.emacs.d/packages/emacs-acid-theme"
       :config
       (load-theme 'acid t))

      (defun snow/switch-theme ()
        "switches between dark and light theme"
        (interactive)
        (if (eq (car custom-enabled-themes) 'acid)
            (progn
              (disable-theme 'acid)
              (enable-theme 'doom-one-light)
              (load "~/.emacs.d/modeline-light.el"))
          (progn
            (disable-theme 'doom-one-light)
            (enable-theme 'acid)
            (load "~/.emacs.d/modeline-dark.el"))))
#+END_SRC

** Which Key
#+BEGIN_SRC emacs-lisp
  (use-package which-key
    :init (which-key-mode)
    :custom
    (which-key-idle-delay 0.3))
#+END_SRC
** Modeline
#+BEGIN_SRC emacs-lisp
  (load "~/.emacs.d/modeline-dark.el")
#+END_SRC

* Font Settings
Save the Fonts I'm using into variables
#+BEGIN_SRC emacs-lisp
  (defvar snow/fixed-width-font "Iosevka Term"
    "The font to use for monospaced (fixed width) text.")

  (defvar snow/variable-width-font "Iosevka Aile"
    "The font to use for variable-pitch (document) text.")
  
  (defvar snow/font-height 120
    "The default height for all fonts")
#+END_SRC

Due to different resolutions on Mac the font should be displayed bigger
#+BEGIN_SRC emacs-lisp
  (defvar snow/font-height 120
    "The default height for all fonts")

  (if (eq system-type 'gnu/linux)
      (progn (set-face-attribute 'default nil
                                 :family snow/fixed-width-font
                                 :height snow/font-height)
             (set-face-attribute 'fixed-pitch nil
                                 :family snow/fixed-width-font
                                 :height snow/font-height)
             (set-face-attribute 'variable-pitch nil
                                 :family snow/variable-width-font
                                 :height snow/font-height))
    (when (not-android)
      (set-face-attribute 'default nil
                          :family snow/fixed-width-font
                          :height snow/font-height)))
#+END_SRC
* Mac OSX Settings
Set option to super and command to meta
#+BEGIN_SRC emacs-lisp
    (setq mac-option-modifier 'super)
    (setq mac-right-option-modifier nil)
    (setq mac-command-modifier 'meta)

    (use-package exec-path-from-shell
      :config
      (when (memq window-system '(mac ns x))
        (exec-path-from-shell-initialize))
      (when (daemonp)
        (exec-path-from-shell-initialize)))
#+END_SRC

* Backups
#+BEGIN_SRC emacs-lisp
  (setq backup-directory-alist `(("." . "~/tmp")))
#+END_SRC

* Editor Settings
#+BEGIN_SRC emacs-lisp
  (setq require-final-newline t)
  (setq-default fill-column 80)
  (setq-default
   whitespace-line-column 80
   whitespace-style '(face lines-tail))
#+END_SRC
Always keep some lines visible underneath and above the cursor, when at the bottom or top of the window
#+BEGIN_SRC emacs-lisp
  (setq scroll-margin 5)
#+END_SRC

Wrap lines so they are shown in the buffer completely without horizontal scrolling
#+BEGIN_SRC emacs-lisp
  (global-visual-line-mode t)
#+END_SRC

Use editorconfig
#+BEGIN_SRC emacs-lisp
  (use-package editorconfig
    :ensure t
    :config
    (editorconfig-mode 1))
#+END_SRC


** Autocompletion
#+BEGIN_SRC emacs-lisp
  (use-package corfu
    :custom
    (corfu-cycle t)
    :bind
    (:map corfu-map ("SPC" . corfu-insert-separator))
    :init
    (global-corfu-mode)
    (corfu-history-mode)
    (corfu-popupinfo-mode))

  (defun snow/eglot-capf ()
    (setq-local completion-at-point-functions
                (list (cape-capf-super
                       #'eglot-completion-at-point
                       #'tempel-expand
                       #'cape-dabbrev))))

  (defun snow/elisp-capf ()
    (setq-local completion-at-point-functions
                (list (cape-capf-super #'elisp-completion-at-point
                                       #'tempel-expand
                                       #'cape-dabbrev))))

  (use-package cape
    :bind ("M-/" . cape-prefix-map)
    :init
    (add-hook 'completion-at-point-functions #'cape-dabbrev)
    (add-hook 'completion-at-point-functions #'cape-file)
    (add-hook 'completion-at-point-functions #'cape-elisp-block)
    (add-hook 'completion-at-point-functions #'cape-elisp-symbol)
    (add-hook 'completion-at-point-functions #'cape-keyword)
    (add-hook 'eglot-managed-mode-hook #'snow/eglot-capf)
    (add-hook 'emacs-lisp-mode-hook #'snow/elisp-capf)
    :config
    (advice-add 'eglot-completion-at-point :around #'cape-wrap-buster))

#+END_SRC

** Global Tab settings
#+BEGIN_SRC emacs-lisp
  (setq-default tab-width 4)
  (setq-default indent-tabs-mode nil)
  (setq-default tab-stop-list (number-sequence 2 120 2))
#+END_SRC
** Parenthesis Handling
*** Highlight parenthesis
#+BEGIN_SRC emacs-lisp
  (show-paren-mode t)
#+END_SRC
*** Create matching parenthesis
#+BEGIN_SRC emacs-lisp
  (electric-pair-mode 1)
#+END_SRC
*** Embrace
Have something similar to vim-surround.
  #+begin_src emacs-lisp
    (use-package embrace
      :bind
      (("C-," . embrace-commander)))
  #+end_src

** Indent Guides
#+BEGIN_SRC emacs-lisp
    (use-package highlight-indent-guides
      :custom
      (highlight-indent-guides-method 'character))
#+END_SRC

** String Inflection
#+BEGIN_SRC emacs-lisp
  (use-package string-inflection)
#+END_SRC
** change-inner
#+begin_src emacs-lisp
  (use-package change-inner
      :bind
      (("M-i" . change-inner)
       ("M-o" . change-outer)))
#+end_src

** Marks
#+begin_src emacs-lisp
  (defun snow/mark-current-line ()
      "Mark the current line."
      (interactive)
      (beginning-of-line)
      (set-mark (point))
      (end-of-line))

  (global-set-key (kbd "C-c l") 'snow/mark-current-line)
 #+end_src 
