roles/emacs/files/init.el
(defun not-android ()
    (not (eq system-type 'android)))

(require 'package)
(setq package-archives
      '(("gnu" . "http://elpa.gnu.org/packages/")
        ("elpa" . "https://elpa.gnu.org/packages/")
        ("melpa" . "https://melpa.org/packages/")))

(package-initialize)
(require 'use-package)
(setq use-package-always-ensure t)
(use-package use-package-ensure-system-package
  :ensure t)

(use-package request
  :if (not-android))

(global-display-line-numbers-mode)

(use-package emacs
  :custom
  (xref-search-program 'ripgrep)
  (tab-always-indent 'complete)
  (text-mode-ispell-word-completion nil)
  (tab-width 2)
  :bind
  ("C-x C-b" . ibuffer)
  :config
  (windmove-default-keybindings))

(use-package polymode)
(use-package aio)

(setq tags-revert-without-query 1)

(scroll-bar-mode -1)
(setq ring-bell-function 'ignore)

(if (eq system-type 'android)
    (menu-bar-mode t)
  (menu-bar-mode -1))

(if (eq system-type 'android)
    (progn
      (tool-bar-mode t)
      (set-frame-parameter nil 'tool-bar-position 'bottom))
  (tool-bar-mode -1))

(when (eq system-type 'android)
  (setq touch-screen-display-keyboard t))

(use-package helpful
  :bind
  ("C-h f" .  helpful-callable)
  ("C-h v" . helpful-variable)
  ("C-h k" . helpful-key)
  :custom
  (counsel-describe-function-function #'helpful-callable)
  (counsel-describe-variable-function #'helpful-variable))

(use-package all-the-icons)
(use-package all-the-icons-dired
  :if (not-android)
  :hook
  (dired-mode . all-the-icons-dired-mode))

(setq tab-bar-show nil)

(use-package doom-themes
   :custom
   (doom-themes-enable-bold t)
   (doom-themes-enable-italic t)
   :config
   (load-theme 'doom-one-light t))

(use-package acid-theme
  :load-path "~/.emacs.d/packages/emacs-acid-theme"
  :config
  (load-theme 'acid t))

 (defun snow/switch-theme ()
   "switches between dark and light theme"
   (interactive)
   (if (eq (car custom-enabled-themes) 'acid)
       (progn
         (disable-theme 'acid)
         (enable-theme 'doom-one-light)
         (load "~/.emacs.d/modeline-light.el"))
     (progn
       (disable-theme 'doom-one-light)
       (enable-theme 'acid)
       (load "~/.emacs.d/modeline-dark.el"))))

(use-package which-key
  :init (which-key-mode)
  :custom
  (which-key-idle-delay 0.3))

(load "~/.emacs.d/modeline-dark.el")

(defvar snow/fixed-width-font "Iosevka Term"
  "The font to use for monospaced (fixed width) text.")

(defvar snow/variable-width-font "Iosevka Aile"
  "The font to use for variable-pitch (document) text.")

(defvar snow/font-height 120
  "The default height for all fonts")

(defvar snow/font-height 120
  "The default height for all fonts")

(if (eq system-type 'gnu/linux)
    (progn (set-face-attribute 'default nil
                               :family snow/fixed-width-font
                               :height snow/font-height)
           (set-face-attribute 'fixed-pitch nil
                               :family snow/fixed-width-font
                               :height snow/font-height)
           (set-face-attribute 'variable-pitch nil
                               :family snow/variable-width-font
                               :height snow/font-height))
  (when (not-android)
    (set-face-attribute 'default nil
                        :family snow/fixed-width-font
                        :height snow/font-height)))

(setq mac-option-modifier 'super)
(setq mac-right-option-modifier nil)
(setq mac-command-modifier 'meta)

(use-package exec-path-from-shell
  :config
  (when (memq window-system '(mac ns x))
    (exec-path-from-shell-initialize))
  (when (daemonp)
    (exec-path-from-shell-initialize)))

(setq backup-directory-alist `(("." . "~/tmp")))

(setq require-final-newline t)
(setq-default fill-column 80)
(setq-default
 whitespace-line-column 80
 whitespace-style '(face lines-tail))

(setq scroll-margin 5)

(global-visual-line-mode t)

(use-package editorconfig
  :ensure t
  :config
  (editorconfig-mode 1))

(use-package corfu
  :custom
  (corfu-cycle t)
  :bind
  (:map corfu-map ("SPC" . corfu-insert-separator))
  :init
  (global-corfu-mode)
  (corfu-history-mode)
  (corfu-popupinfo-mode))

(defun snow/eglot-capf ()
  (setq-local completion-at-point-functions
              (list (cape-capf-super
                     #'eglot-completion-at-point
                     #'tempel-expand
                     #'cape-dabbrev))))

(defun snow/elisp-capf ()
  (setq-local completion-at-point-functions
              (list (cape-capf-super #'elisp-completion-at-point
                                     #'tempel-expand
                                     #'cape-dabbrev))))

(use-package cape
  :bind ("M-/" . cape-prefix-map)
  :init
  (add-hook 'completion-at-point-functions #'cape-dabbrev)
  (add-hook 'completion-at-point-functions #'cape-file)
  (add-hook 'completion-at-point-functions #'cape-elisp-block)
  (add-hook 'completion-at-point-functions #'cape-elisp-symbol)
  (add-hook 'completion-at-point-functions #'cape-keyword)
  (add-hook 'eglot-managed-mode-hook #'snow/eglot-capf)
  (add-hook 'emacs-lisp-mode-hook #'snow/elisp-capf)
  :config
  (advice-add 'eglot-completion-at-point :around #'cape-wrap-buster))

(setq-default tab-width 4)
(setq-default indent-tabs-mode nil)
(setq-default tab-stop-list (number-sequence 2 120 2))

(show-paren-mode t)

(electric-pair-mode 1)

(use-package embrace
  :bind
  (("C-," . embrace-commander)))

(use-package highlight-indent-guides
  :custom
  (highlight-indent-guides-method 'character))

(use-package string-inflection)

(use-package change-inner
    :bind
    (("M-i" . change-inner)
     ("M-o" . change-outer)))

(defun snow/mark-current-line ()
    "Mark the current line."
    (interactive)
    (beginning-of-line)
    (set-mark (point))
    (end-of-line))

(global-set-key (kbd "C-c l") 'snow/mark-current-line)
