roles/emacs/files/init.org
* Buffer Management 
#+BEGIN_SRC emacs-lisp
  (use-package popper
    :after (shackle project)
    :bind (("C-'"   . popper-toggle-latest)
           ("M-'"   . popper-cycle)
           ("C-M-'" . popper-toggle-type))
    :custom
    (popper-display-control nil)
    (popper-group-function #'popper-group-by-project)
    :init
    (setq popper-reference-buffers
          '("\\*info\\*"
            "\\*Ledger Report\\*"
            "\\*Messages\\*"
            compilation-mode
            eshell-mode
            help-mode
            helpful-mode
            magit-status-mode
            rg-mode
            vterm-mode))
    (popper-mode +1)
    (popper-echo-mode +1))

  (use-package shackle
    :config
    (setq shackle-rules '(
                          (compilation-mode :noselect t)
                          (("^\\*eshell.*?\\*" "^\\*vterm.*?\\*") :regexp t :other t :select t)
                          (" *transient*" :align below)
                          ("*Completions*" :align above :select t)
                          ))
    (setq shackle-default-rule '(:select t))
    (shackle-mode t))
#+END_SRC

* File Handling

#+BEGIN_SRC emacs-lisp
  (global-auto-revert-mode 1)
#+END_SRC
  
* Prompt Settings
#+BEGIN_SRC emacs-lisp
  (defalias 'yes-or-no-p 'y-or-n-p)
#+END_SRC

* Custom File Settings
#+BEGIN_SRC emacs-lisp
  (setq custom-file "~/.emacs.d/custom.el")
  (load custom-file 'noerror 'nomessage)
#+END_SRC

* Ediff
#+BEGIN_SRC emacs-lisp
  (setq ediff-window-setup-function 'ediff-setup-windows-plain)
  (custom-set-faces
   ;; custom-set-faces was added by Custom.
   ;; If you edit it by hand, you could mess it up, so be careful.
   ;; Your init file should contain only one such instance.
   ;; If there is more than one, they won't work right.
   '(ediff-current-diff-Ancestor ((t (:background "#223448" :foreground "#4db5bd"))))
   '(ediff-current-diff-B ((t (:inherit ediff-current-diff-A :background "#223448" :foreground "#50a14f"))))
   '(ediff-current-diff-C ((t (:inherit ediff-current-diff-A :background "#223448" :foreground "dark gray")))))
#+END_SRC
* Org Mode
First define the different paths between Android and the normal notes location and set the org-directory. Setting org-directory in the init block is deferred and my custom agendas and capture templates are not read.
#+begin_src emacs-lisp
  (defvar snow/android-notes-path "/content/storage/com.android.externalstorage.documents/primary:Sync%2Fnotes")
  (defvar snow/notes-path "~/Sync/notes")

  ;; Set org-directory early so other packages can use it
  (setq org-directory (if (eq system-type 'android)
                          snow/android-notes-path
                        snow/notes-path))
#+end_src

Now configure org-mode
#+BEGIN_SRC emacs-lisp
    (use-package org
      :demand t
      :hook
      (org-after-todo-statistics . org-summary-todo)
      (org-mode . flyspell-mode)
      :bind
      ("C-c o a" . org-agenda)
      ("C-c o c" . org-capture)
      ("C-c o s" . snow/rg-org)
      (:map org-mode-map
                  ("C-c S" . snow/org-start-presentation))
      (:map flyspell-mode-map
            ("M-TAB" . nil))
      :custom
      ;; AGENDA SETTINGS
      (org-agenda-files (file-expand-wildcards (concat org-directory "/roam/pages/agenda/*.org")))
      (org-agenda-skip-deadline-if-done t)
      (org-agenda-skip-deadline-prewarning-if-scheduled t)
      (org-agenda-skip-scheduled-if-deadline-is-shown t)
      (org-agenda-skip-scheduled-if-done t)
      (org-agenda-window-setup 'current-window)
      (org-archive-location "%s_archive::datetree/* Archived Tasks")
      (org-babel-python-command "python3")
      (org-confirm-babel-evaluate nil)
      (org-default-notes-file (concat org-directory "/capture.org"))
      (org-ellipsis " ")
      (org-image-actual-width nil)
      (org-todo-keywords '((sequence "TODO(t)" "TODAY(y)" "WAITING(w)" "|" "DONE(d)")
                           (sequence "|" "CANCELLED(c)")))
      ;; Open org links in the same buffer instead of splitting
      (org-link-frame-setup '((file . find-file)))
      :config
      (set-face-attribute 'org-ellipsis nil :background 'unspecified :box nil)
      (advice-add 'org-agenda-todo :after 'org-save-all-org-buffers)
      (advice-add 'org-archive-subtree :after 'org-save-all-org-buffers)
      (require 'org-faces)
      (require 'ox-md)
      ;; Hide emphasis markers on formatted text
      (setq org-hide-emphasis-markers t)
      ;; Resize Org headings
      (dolist (face '((org-level-1 . 1.25)
                      (org-level-2 . 1.2)
                      (org-level-3 . 1.15)
                      (org-level-4 . 1.1)
                      (org-level-5 . 1.05)
                      (org-level-6 . 1.0)
                      (org-level-7 . 1.0)
                      (org-level-8 . 1.0)))
        (set-face-attribute (car face) nil :font snow/variable-width-font :weight 'medium :height (cdr face)))
      ;; Make sure certain org faces use the fixed-pitch face when variable-pitch-mode is on
      (set-face-attribute 'org-block nil :foreground nil :inherit 'fixed-pitch)
      (set-face-attribute 'org-table nil :inherit 'fixed-pitch)
      (set-face-attribute 'org-formula nil :inherit 'fixed-pitch)
      (set-face-attribute 'org-code nil :inherit '(shadow fixed-pitch))
      (set-face-attribute 'org-verbatim nil :inherit '(shadow fixed-pitch))
      (set-face-attribute 'org-special-keyword nil :inherit '(font-lock-comment-face fixed-pitch))
      (set-face-attribute 'org-meta-line nil :inherit '(font-lock-comment-face fixed-pitch))
      (set-face-attribute 'org-checkbox nil :inherit 'fixed-pitch))

  (defun org-summary-todo (n-done n-not-done)
      "Switch entry to DONE when all subentries are done, to TODO otherwise."
      (let (org-log-done org-log-states)   ; turn off logging
        (org-todo (if (= n-not-done 0) "DONE" "TODO"))))
    
    (put 'dired-find-alternate-file 'disabled nil)
#+END_SRC

** Babel Tangle Config
#+BEGIN_SRC emacs-lisp
  (defun snow/org-babel-tangle-config ()
    (when (string-equal (buffer-file-name)
                        (expand-file-name "~/workspace/snow/roles/emacs/files/init.org"))
      ;; Dynamic scoping to the rescue
      (let ((org-confirm-babel-evaluate nil))
        (org-babel-tangle))))

  (add-hook 'org-mode-hook (lambda () (add-hook 'after-save-hook #'snow/org-babel-tangle-config)))

#+END_SRC
** Holiday Settings
Only show the typical german holidays
#+BEGIN_SRC emacs-lisp
  (setq solar-n-hemi-seasons
        '("Frühlingsanfang" "Sommeranfang" "Herbstanfang" "Winteranfang"))

  (setq holiday-general-holidays
        '((holiday-fixed 1 1 "Neujahr")
          (holiday-fixed 5 1 "1. Mai")
          (holiday-fixed 10 3 "Tag der Deutschen Einheit")))

  (setq holiday-christian-holidays
        '((holiday-float 12 0 -4 "1. Advent" 24)
          (holiday-float 12 0 -3 "2. Advent" 24)
          (holiday-float 12 0 -2 "3. Advent" 24)
          (holiday-float 12 0 -1 "4. Advent" 24)
          (holiday-fixed 12 25 "1. Weihnachtstag")
          (holiday-fixed 12 26 "2. Weihnachtstag")
          (holiday-fixed 1 6 "Heilige Drei Könige")
          (holiday-easter-etc -48 "Rosenmontag")
          (holiday-easter-etc -3 "Gründonnerstag")
          (holiday-easter-etc  -2 "Karfreitag")
          (holiday-easter-etc   0 "Ostersonntag")
          (holiday-easter-etc  +1 "Ostermontag")
          (holiday-easter-etc +39 "Christi Himmelfahrt")
          (holiday-easter-etc +49 "Pfingstsonntag")
          (holiday-easter-etc +50 "Pfingstmontag")
          (holiday-easter-etc +60 "Fronleichnam")
          (holiday-fixed 8 15 "Mariae Himmelfahrt")
          (holiday-fixed 11 1 "Allerheiligen")
          (holiday-float 11 3 1 "Buss- und Bettag" 16)
          (holiday-float 11 0 1 "Totensonntag" 20)))

  (setq holiday-hebrew-holidays nil)
  (setq holiday-islamic-holidays nil)
  (setq holiday-bahai-holidays nil)
  (setq holiday-oriental-holidays nil)

#+END_SRC
** Babel
#+BEGIN_SRC emacs-lisp
  (use-package ob-async)
  (use-package ob-typescript)

  (org-babel-do-load-languages
   'org-babel-load-languages
   '((emacs-lisp . t)
     (eshell . t)
     (gnuplot . t)
     (python . t)
     (shell . t)
     (typescript . t)))

#+END_SRC
** Org Modern
Gives different org syntax modern ligatures. Doesn't work on Android natively and 
#+BEGIN_SRC emacs-lisp
  (use-package org-modern
    :if (not-android)
    :after org
    :hook (org-mode . org-modern-mode))
#+END_SRC
