roles/emacs/files/init.el

(defun snow/org-capf ()
  (setq-local completion-at-point-functions
              (list (cape-capf-super
                     #'org-roam-complete-everywhere
                     #'org-roam-complete-link-at-point
                     #'tempel-expand
                     #'cape-file
                     #'cape-dabbrev))))

(use-package org-roam
  :after org
  :demand t
  :init
  (setq org-roam-v2-ack t)
  :bind
  ("C-c o r d" . org-roam-dailies-map)
  ("C-c o r f" . org-roam-node-find)
  (:map org-mode-map
              ("C-c C-n C-i" . org-roam-node-insert))
  :custom
  (org-roam-directory (concat org-directory "/roam"))
  (org-roam-dailies-directory "journals/")
  (org-roam-completion-everywhere t)
  (org-roam-capture-templates
   '(("b" "book notes" plain (file (concat org-roam-directory "/templates/booknote.org"))
      :target (file+head "pages/${slug}.org" "#+title: ${title}\n")
      :unnarrowed t)
     ("d" "default" plain
      "%?"
      :target (file+head "pages/${slug}.org" "#+title: ${title}\n")
      :unnarrowed t)))
  (org-roam-dailies-capture-templates
   '(("j" "journal" plain "\n** %<%H:%M>: %?"
      :target (file+head+olp "%<%Y-%m-%d>.org"
                             "#+title: %<%Y-%m-%d>\n"
                             ("Journal"))
      :unnarrowed t
      :immediate-finish nil)))
  :config
  (require 'org-roam-dailies)
  (org-roam-db-autosync-mode)
  (add-hook 'org-mode-hook #'snow/org-capf)
  ;; Load Custom Agendas
  (let ((custom-agenda-commands (expand-file-name "custom-agenda-commands.el" org-directory)))
    (if (file-exists-p custom-agenda-commands)
        (load custom-agenda-commands)
      (message (format "%s not found." custom-agenda-commands))))
  ;; Load Capture Templates
  (let ((capture-templates (expand-file-name "capture-templates.el" org-directory)))
    (if (file-exists-p capture-templates)
        (load capture-templates)
      (message (format "%s not found." capture-templates)))))

(use-package org-ql
  :after '(org org-roam)
  :config
  ;; Load org-ql views
  (let ((org-ql-views (expand-file-name "org-ql-views.el" org-directory)))
    (if (file-exists-p org-ql-views)
        (load org-ql-views)
      (message (format "%s not found." org-ql-views)))))

(use-package visual-fill-column
    :custom
    (visual-fill-column-width 120)
    (visual-fill-column-center-text nil))

(use-package hide-mode-line)

(defun snow/org-start-presentation ()
    (interactive)
    (org-tree-slide-mode 1)
    (setq text-scale-mode-amount 2)
    (text-scale-mode 1)
    (visual-line-mode 1)
    (visual-fill-column-mode 1)
    (display-line-numbers-mode -1)
    (visual-fill-column-center-text t)
    (org-display-inline-images)
    (hide-mode-line-mode 1)
    ;; Set up keybindings for presentation mode
    (define-key org-tree-slide-mode-map (kbd "<right>") 'org-tree-slide-move-next-tree)
    (define-key org-tree-slide-mode-map (kbd "<left>") 'org-tree-slide-move-previous-tree)
    (define-key org-tree-slide-mode-map (kbd "Q") 'snow/org-end-presentation))

(defun snow/org-end-presentation ()
    (interactive)
    (text-scale-mode 0)
    (org-tree-slide-mode 0)
    (visual-line-mode 0)
    (visual-fill-column-center-text nil)
    (display-line-numbers-mode 1)
    (hide-mode-line-mode 0))

(use-package org-tree-slide
    :defer t
    :after '(org visual-fill-column)
    :commands org-tree-slide-mode)

(use-package ox-hugo
  :after ox)

(setq ispell-program-name "aspell")

(global-set-key (kbd "<escape>") 'keyboard-escape-quit)

(use-package hydra)

(defhydra hydra-scale-window (:timeout 4)
  "scale window"
  ("m" enlarge-window-horizontally "h+")
  ("i" shrink-window-horizontally "h-")
  ("n" enlarge-window "v+")
  ("e" shrink-window "v-")
  ("q" nil "finished" :exit t))

(defhydra hydra-scale-font (:timeout 4)
  "scale text"
  ("n" text-scale-increase "+")
  ("e" text-scale-decrease "-")
  ("q" nil "finished" :exit t))

(use-package erc
  :custom
  (erc-prompt-for-password nil)
  (erc-modules '(autojoin fill notifications stamp track))
  (erc-autojoin-timing 'ident)
  (erc-autojoin-channels-alist '(("libera.chat" "#systemcrafters" "#emacs")))
  (erc-rename-buffers t)
  (erc-track-exclude-types '("JOIN" "NICK" "QUIT" "MODE" "AWAY"))
  (erc-hide-list '("JOIN" "NICK" "PART" "QUIT" "MODE" "AWAY"))
  (erc-timestamp-only-if-changed-flag nil)
 (erc-timestamp-format "%H:%M ")
  (erc-insert-timestamp-function 'erc-insert-timestamp-left)
  (erc-fill-prefix "      ")
  (erc-fill-column 120)
  :config
  (setq erc-prompt-for-nickserv-password nil))

(use-package erc-hl-nicks
  :after erc
  :config
  (add-to-list 'erc-modules 'hl-nicks))

(defun snow/erc ()
  "Join ERC with default settings."
  (interactive)
  (erc-tls
   :server "irc.libera.chat"
   :port "6697"
   :nick "snowiow"))

(use-package cider)
(use-package clojure-mode)

(use-package cue-mode)

(use-package dart-mode
  :hook
  (dart-mode . flutter-test-mode))

(use-package flutter
  :after dart-mode
  :custom
  (flutter-sdk-path "~/flutter/"))

(use-package flutter-l10n-flycheck
  :after flutter
  :config
  (flutter-l10n-flycheck-setup))

(use-package dockerfile-mode)

(use-package package-lint)

(use-package go-ts-mode
  :ensure nil
  :mode "\\.go\\'"
  :hook
  (go-ts-mode . eglot-ensure)
  :config
  (setq go-ts-mode-indent-offset 4))

(use-package json-ts-mode
  :ensure nil
  :bind (:map json-ts-mode-map
              ("C-c C-l f" . json-pretty-print-buffer))
  :mode "\\.json\\'"
  :hook
  (json-ts-mode . eglot-ensure))

(use-package jsonnet-mode)

(use-package ledger-mode)

(use-package markdown-ts-mode
  :mode "\\.md\\'"
  :config
  (setq markdown-command "multimarkdown")
  (setq markdown-command "pandoc -f markdown -t html")
  (add-to-list 'auto-mode-alist '("\\.md\\'" . markdown-ts-mode))
  :hook
  (markdown-ts-mode . flyspell-mode))

(use-package plantuml-mode
 :config
(add-to-list 'auto-mode-alist '("\\.puml\\'" . plantuml-mode))
(add-to-list 'auto-mode-alist '("\\.plantuml\\'" . plantuml-mode)))

(use-package protobuf-mode
 :config
(add-to-list 'auto-mode-alist '("\\.proto\\'" . protobuf-mode)))

(use-package pyvenv
  :diminish
  :config
  (setq pyvenv-mode-line-indicator
        '(pyvenv-virtual-env-name ("[venv:" pyvenv-virtual-env-name "] ")))
  (pyvenv-mode +1))

(use-package python-mode)

(use-package terraform-mode
  :hook
  (terraform-mode . terraform-format-on-save-mode)
  (terraform-mode . eglot-ensure))
