roles/emacs/files/init.org
** Tree-sitter Configuration
#+BEGIN_SRC emacs-lisp
  (setq treesit-language-source-alist
        '((elisp "https://github.com/Wilfred/tree-sitter-elisp")
          (go "https://github.com/tree-sitter/tree-sitter-go")
          (javascript "https://github.com/tree-sitter/tree-sitter-javascript" "master" "src")
          (json "https://github.com/tree-sitter/tree-sitter-json")
          (make "https://github.com/alemuller/tree-sitter-make")
          (markdown "https://github.com/tree-sitter-grammars/tree-sitter-markdown" "split_parser" "tree-sitter-markdown/src")
          (markdown-inline "https://github.com/tree-sitter-grammars/tree-sitter-markdown" "split_parser" "tree-sitter-markdown-inline/src")
          (toml "https://github.com/tree-sitter/tree-sitter-toml")
          (tsx "https://github.com/tree-sitter/tree-sitter-typescript" "master" "tsx/src")
          (typescript "https://github.com/tree-sitter/tree-sitter-typescript" "master" "typescript/src")
          (yaml "https://github.com/ikatyang/tree-sitter-yaml")))
#+END_SRC
** Typescript
#+BEGIN_SRC emacs-lisp
    (use-package typescript-ts-mode
      :ensure nil
      :mode (("\\.ts\\'" . typescript-ts-mode)
             ("\\.tsx\\'" . tsx-ts-mode))
      :custom
      (typescript-ts-mode-indent-offset 2)
      :hook
      (typescript-ts-mode . eglot-ensure)
      (tsx-ts-mode . eglot-ensure))
#+END_SRC
** Yaml
#+BEGIN_SRC emacs-lisp
    (defun snow/yaml-capf ()
      (setq-local completion-at-point-functions
                  (list (cape-capf-super
                         #'cape-dabbrev
                         #'cape-keyword))))

    (use-package yaml-ts-mode
      :ensure nil
      :mode (("\\.yml\\'" . yaml-ts-mode)
             ("\\.yaml\\'" . yaml-ts-mode))
      :hook
      (yaml-ts-mode . snow/yaml-capf)
      (yaml-ts-mode . highlight-indent-guides-mode)
      (yaml-ts-mode . eglot-ensure))
#+END_SRC
* Navigation
#+BEGIN_SRC emacs-lisp
      (use-package vertico
        :init
        (vertico-mode t)
        :config
        (setq vertico-count 10
              vertico-resize nil
              vertico-cycle t)
        (define-key minibuffer-local-completion-map " " 'self-insert-command))

      (use-package orderless
        :init
        (setq completion-styles '(orderless basic)
              completion-category-defaults nil
              completion-category-overrides '((file (styles partial-completion))
                                             (eglot (styles orderless))
                                      (eglot-capf (styles orderless)))))

      (use-package marginalia
        :bind (:map minibuffer-local-map
                    ("M-A" . marginalia-cycle))
        :init
        (marginalia-mode))

      (use-package consult)

      (use-package embark
        :custom
        (embark-quit-after-action nil)
        :config
        (setq prefix-help-command #'embark-prefix-help-command)
        :bind
        (("C-." . embark-act)       
         ("C-;" . embark-dwim)       
         ("C-h B" . embark-bindings)))

      (use-package embark-consult
        :ensure t
        :after (embark consult))
#+END_SRC
* Dired
#+begin_src emacs-lisp
  (defun snow/dired-open-locally ()
    "Make a local file copy of the remote file under the cursor in dired and
                                 opens it.  Mainly used to open pdfs or other complex formats From remote machines"
    (interactive)
    (let* ((filename (dired-get-filename nil t))
           (local-tmp-file (file-local-copy filename)))
      (find-file local-tmp-file)))

  (use-package dired
    :ensure nil
    :commands (dired dired-jump))

#+end_src
* Programming
** Linting
#+BEGIN_SRC emacs-lisp
  (use-package flycheck
    :init
    (global-flycheck-mode)
    :custom
    (flycheck-check-syntax-automatically '(save new-line mode-enabled))
    :config
    (define-derived-mode cfn-json-mode js-mode
      "CFN-JSON"
      "Simple mode to edit CloudFormation template in JSON format."
      (setq js-indent-level 2))

    (add-to-list 'magic-mode-alist
                 '("\\({\n *\\)? *[\"']AWSTemplateFormatVersion" . cfn-json-mode))

    ;; Set up a mode for YAML based templates if yaml-ts-mode is installed
      (define-derived-mode cfn-yaml-mode yaml-ts-mode
        "CFN-YAML"
        "Simple mode to edit CloudFormation template in YAML format.")
    
      (add-to-list 'magic-mode-alist
                   '("\\(---\n\\)?AWSTemplateFormatVersion:" . cfn-yaml-mode))

    ;; Set up cfn-lint integration if flycheck is installed
    ;; Get flycheck here https://www.flycheck.org/
    (when (featurep 'flycheck)
      (flycheck-define-checker cfn-lint
        "AWS CloudFormation linter using cfn-lint.

  Install cfn-lint first: pip install cfn-lint

  See `https://github.com/aws-cloudformation/cfn-python-lint'."

        :command ("cfn-lint" "-f" "parseable" source)
        :error-patterns ((warning line-start (file-name) ":" line ":" column
                                  ":" (one-or-more digit) ":" (one-or-more digit) ":"
                                  (id "W" (one-or-more digit)) ":" (message) line-end)
                         (error line-start (file-name) ":" line ":" column
                                ":" (one-or-more digit) ":" (one-or-more digit) ":"
                                (id "E" (one-or-more digit)) ":" (message) line-end))
        :modes (cfn-json-mode cfn-yaml-mode))

      (add-to-list 'flycheck-checkers 'cfn-lint)
      (add-hook 'cfn-json-mode-hook 'flycheck-mode)
      (add-hook 'cfn-yaml-mode-hook 'flycheck-mode)))
#+END_SRC
** Language Server Protocol
*** Eglot
#+begin_src emacs-lisp
    (use-package eglot
     :ensure nil
     :config
     (add-to-list 'eglot-server-programs
                  '(terraform-mode . ("terraform-ls" "serve"))))
#+end_src
* Project Management

** project.el
#+BEGIN_SRC emacs-lisp
    (use-package project
      :ensure nil
      :bind (:map project-prefix-map
                  ("R" . 'snow/rg-project)
                  ("m" . 'magit-status))
      :config
      (when (eq system-type 'android)
        (project-remember-projects-under snow/android-notes-path)))
#+END_SRC

Create a way to add local projects to the project.el project list. Normally only directories in version control are recognized as projects by project.el.
This code snippet adds an additional function to the =project-find-functions= which searches for a /.project/ file in the root of the chosen directory. If it is present, the directory is seen as a project by project.el

#+BEGIN_SRC emacs-lisp
  (cl-defmethod project-root ((project (head local)))
    (cdr project))

  (defun snow/project-try-local (dir)
    "Determine if DIR is a non-Git project.
         DIR must include a .project file to be considered a project."
    (let ((root (locate-dominating-file dir ".project")))
      (and root (cons 'local root))))

  (add-hook 'project-find-functions 'snow/project-try-local)

#+END_SRC

This snippet adds an advice around the =project-switch-project= function to automatically rename the current tab to the name of the chosen project. This is to better distinguish, which project is opened in which tab.

#+BEGIN_SRC emacs-lisp
  (defun snow/project-to-tab-name (path)
    "Extract the last directory name from PATH to set it as the tab name."
    (file-name-nondirectory (directory-file-name path)))

  (defun snow/project-switch-project (orig-fun &rest args)
    "Rename current tab to the selected project."
    (let* ((project-dir (or (car args) (project-prompt-project-dir)))
           (tab-name (snow/project-to-tab-name project-dir)))
      (tab-bar-rename-tab tab-name)
      (funcall orig-fun project-dir)))

  (advice-add 'project-switch-project :around #'snow/project-switch-project)
#+END_SRC
* Shell
