roles/emacs/files/init.el

(defun snow/eshell-prompt ()
    (let (
          (current-branch (when (fboundp 'magit-get-current-branch) (magit-get-current-branch)))
          (aws-vault (getenv "AWS_VAULT"))
          (k8s-context (shell-command-to-string "kubectl config current-context")))
      (concat
       "\n"
       (propertize (user-login-name) 'face 'font-lock-type-face)
       (propertize "@" 'face 'default)
       (propertize (system-name) 'face 'font-lock-function-name-face)
       (when current-branch
         (propertize (concat "  " current-branch) 'face 'font-lock-keyword-face))
       (when (boundp 'kubel-context)
         (propertize (concat " k8s: " k8s-context) 'face 'font-lock-warning-face))
       (when aws-vault
         (propertize (concat "  " aws-vault) 'face 'font-lock-string-face))
       "\n"
       (propertize (eshell/pwd) 'face 'font-lock-constant-face)
       "\n"
       (propertize "$ " 'face 'eshell-prompt))))

  (defun snow/eshell-config ()
    (eshell-hist-initialize)
    (define-key eshell-mode-map (kbd "<tab>") 'completion-at-point)
    (define-key eshell-mode-map (kbd "<up>") 'eshell-previous-input)
    (define-key eshell-mode-map (kbd "<down>") 'eshell-next-input)
    (define-key eshell-mode-map (kbd "C-r") 'consult-history))

  (use-package eshell
    :hook
    (eshell-first-time-mode . snow/eshell-config)
    (eshell-pre-command . eshell-save-some-history)
    :custom
    (eshell-prompt-function 'snow/eshell-prompt)
    (eshell-prompt-regexp "^$ "))

  (use-package esh-autosuggest
    :hook (eshell-mode . esh-autosuggest-mode)
    :custom
    (esh-autosuggest-delay 0.5))

  (use-package eshell-syntax-highlighting
    :if (not-android)
    :after esh-mode
    :custom  
    (eshell-syntax-highlighting-global-mode +1))

(defun snow/eshell-new-frame ()
    "Open a new frame with a new vterm session."
    (interactive)
    (let ((new-frame (make-frame)))
      (select-frame new-frame)
      (eshell (generate-new-buffer-name "*eshell*"))))

(use-package tramp
  :custom
  (tramp-default-method "ssh")
  (tramp-default-user "snow")
  (tramp-default-host "cloudpi"))

(use-package vterm
  :if (not-android))

(defun snow/vterm-new-frame ()
  "Open a new frame with a new vterm session."
  (interactive)
  (let ((new-frame (make-frame)))
    (select-frame new-frame)
    (vterm (generate-new-buffer-name "*vterm*"))))

(use-package eat
  :load-path "~/.emacs.d/packages/emacs-eat"
  :hook
  (eshell-mode . eat-eshell-mode))

(use-package auth-source-pass
  :if (not-android)
  :ensure nil
  :config
  (auth-source-pass-enable)
  :custom
  (auth-sources '(password-store)))

(use-package browse-at-remote
  :bind
  ("C-c g w" . browse-at-remote))

(use-package forge
  :if (not-android))

(use-package git-link
  :if (not-android)
  :custom
  (git-link-open-in-browser t))

(use-package github-review
  :if (not-android))

(use-package emacsql)
(use-package magit
  :init
  (setq magit-show-long-lines-warning nil)
  :bind
  ("C-c g g" . magit-status)
  ("C-c g c" . magit-clone)
  ("C-c g b" . magit-blame))

;; Keybinding for commit message buffers
(with-eval-after-load 'git-commit
  (add-hook 'git-commit-mode-hook
            (lambda ()
              (local-set-key (kbd "C-c b") 'snow/branch-name-to-commit-msg))))

(use-package mu4e
  :if (not-android)
  :ensure nil
  :load-path "/usr/share/emacs/site-lisp/elpa-src/mu4e-1.12.9"
  :custom
  (mu4e-update-interval (* 30 60))
  (mu4e-get-mail-command "offlineimap")
  ;; refresh mail every 30 minutes
  (mu4e-compose-format-flowed t)
  (mu4e-drafts-folder "/Drafts")
  (mu4e-sent-folder "/Sent")
  (mu4e-refile-folder "/Archiv")
  (mu4e-trash-folder "/Trash")
  (user-mail-address "marcel.patzwahl@posteo.de")

  ;; smtp settings
  (smtpmail-default-smtp-server "posteo.de")
  (smtpmail-smtp-server "posteo.de")
  (smtpmail-smtp-user "marcel.patzwahl@posteo.de")
  (smtpmail-smtp-service 587)
  (smtpmail-stream-type 'starttls)
  (message-send-mail-function 'smtpmail-send-it)
  :config
  (mu4e t)
  (add-to-list 'mu4e-view-actions '("ViewInBrowser" . mu4e-action-view-in-browser) t))

(use-package kubel
  :bind
  (:map kubel-mode-map
        ("N" . kubel-set-namespace))
  :config
  (setq kubel-use-namespace-list 'on))

(use-package tempel
:bind (("M-+" . tempel-complete) ;; Alternative tempel-expand
       ("M-*" . tempel-insert))

:init

;; Setup completion at point
(defun tempel-setup-capf ()
(setq-local completion-at-point-functions
            (cons #'tempel-expand completion-at-point-functions))))

(use-package ripgrep
  :if (not-android))

(use-package rg
  :if (not-android)
  :config
  (rg-define-search snow/rg-org
    :query ask
    :format regexp
    :files "*.org"
    :case-fold-search smart
    :dir org-directory
    :confirm prefix)
  (rg-define-search snow/rg-project
    :query ask
    :format regexp
    :files ""
    :case-fold-search smart
    :dir (if (project-current) (project-root (project-current))
           default-directory)
    :confirm prefix
    :flags ("--hidden -g !.git")))

(use-package agent-shell
    :ensure t
    :ensure-system-package
    ;; Add agent installation configs here
    ((claude-agent-acp . "npm install -g @zed-industries/claude-agent-acp")))

(use-package claude-code-ide
  :vc (:url "https://github.com/manzaltu/claude-code-ide.el" :rev :newest)
  :bind ("C-c a" . claude-code-ide-menu)
  :config
  (claude-code-ide-emacs-tools-setup))

(use-package xdg-launcher
      :load-path "~/.emacs.d/packages/xdg-launcher")

(defun snow/app-launcher ()
  "Start xdg-launcher in a floating Emacs frame for app launching.
Frame is created by emacsclient -c for proper Wayland focus."
  (interactive)
  (switch-to-buffer (get-buffer-create " *app-launcher*"))
  (setq-local mode-line-format nil)
  (setq-local header-line-format nil)
  (setq-local cursor-type nil)
  (let ((window-min-height 1)
        (vertico-count 10)
        (vertico-resize nil))
    (unwind-protect
        (xdg-launcher-run-app)
      (delete-frame))))

(defun snow/setup-wayland-clipboard (&optional frame)
  (when (and (display-graphic-p frame)
             (getenv "WAYLAND_DISPLAY"))
    (setq interprogram-cut-function
          (lambda (text)
            (start-process "wl-copy" nil "wl-copy" "--" text)))
    (setq interprogram-paste-function
          (lambda ()
            (let ((clipboard (string-trim (shell-command-to-string "wl-paste -n 2>/dev/null"))))
              (unless (string-empty-p clipboard)
                clipboard))))))
(if (daemonp)
    (add-hook 'after-make-frame-functions #'snow/setup-wayland-clipboard)
  (snow/setup-wayland-clipboard))

(use-package openwith
  :if (not-android)
  :config
  (add-to-list 'mm-inhibit-file-name-handlers 'openwith-file-handler) ;; needed to not randomly open the attachment when trying to send it
  (setq openwith-associations
        (list
         (list (openwith-make-extension-regexp
                '("pdf"))
               "open"
               '(file))))
  (openwith-mode t))
