roles/emacs/files/init.org
* Useful functions
#+BEGIN_SRC emacs-lisp
(defun snow/yank-markdown-as-org ()
  "Yank Markdown text as Org.

This command will convert Markdown text in the top of the `kill-ring'
and convert it to Org using the pandoc utility."
  (interactive)
  (save-excursion
    (with-temp-buffer
      (yank)
      (shell-command-on-region
       (point-min) (point-max)
       "pandoc -f markdown -t org --wrap=preserve" t t)
      (kill-region (point-min) (point-max)))
    (yank)))
#+END_SRC

* Other Applications
#+BEGIN_SRC emacs-lisp
    (defun snow/dashboard-filter-agenda-today-or-earlier ()
      "Exclude agenda items scheduled after today.
  Return nil to include the entry, return point to exclude it."
      (let ((scheduled-time (org-get-scheduled-time (point)))
            (end-of-today (org-time-string-to-time
                           (format-time-string "%Y-%m-%d 23:59:59" (current-time)))))
        ;; Exclude (return point) if scheduled time is after today
        (when (and scheduled-time
                   (time-less-p end-of-today scheduled-time))
          (point))))

    (use-package dashboard
      :if (not-android)
      :after org
      :custom
      (dashboard-startup-banner (expand-file-name "~/workspace/snow/img/banner.png"))
      (tab-bar-new-tab-choice "*dashboard*")
      (dashboard-projects-backend 'project-el)
      (dashboard-week-agenda nil)
      (dashboard-match-agenda-entry "+SCHEDULED<=\"<today>\"")
      (dashboard-items '((agenda . 5)
                         (projects . 5)
                         (recents  . 5)))
      :config
      (dashboard-setup-startup-hook))

    (use-package gnuplot
      :if (not-android))

    (use-package pass
      :if (not-android))

    (use-package proced
      :config
      (add-hook 'proced-mode-hook
                (lambda ()
                  (proced-toggle-auto-update t))))
#+END_SRC
* Experimental Stuff
#+BEGIN_SRC emacs-lisp
  (use-package aws
    :load-path "~/.emacs.d/packages/aws.el"
    :commands (aws aws-login) 
    :custom
    (aws-login-method 'sso)
    (aws-output "yaml")
    (aws-organizations-account "Moia-Master:pe-infra-engineer-m"))

  (use-package aws-evil
    :after aws
    :load-path "~/.emacs.d/packages/aws.el")

  (defun snow/branch-name-to-commit-msg ()
   (interactive)
   (let* ((branch (magit-get-current-branch))
         (commit-msg (replace-regexp-in-string "MOIA \\([0-9]+\\) " "MOIA-\\1: "
             (string-replace "-" " "
             (string-replace "moia" "MOIA" branch)))))
      (insert commit-msg)))

  (use-package org-roam-readwise
    :if (not-android)
    :load-path "~/.emacs.d/packages/org-roam-readwise"
    :after org-roam
    :custom
    (org-roam-readwise-output-location (concat org-roam-directory "/pages/readwise"))
    (org-readwise-sync-highlights t)
    (org-readwise-sync-reader nil)
    (org-readwise-auth-source 'auth-source-pass)
    (org-readwise-debug-level 2)
    (readwise-debug-level 2))

#+END_SRC
